Revit 2027 API
IExportContext.OnFaceEnd Method
 This method marks the end of the current face being exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void OnFaceEnd(
	FaceNode node
)
Sub OnFaceEnd (
	node As FaceNode
)
void OnFaceEnd(
	FaceNode^ node
)
abstract OnFaceEnd :
        node : FaceNode -> unit
Parameters
node FaceNode
 An output node that represents a Face.
See Also
Reference
IExportContext Interface
Autodesk.Revit.DB Namespace